import 'package:ebus/helpers/Constants.dart';
import 'package:flutter/material.dart';

class AboutUsViewModel with ChangeNotifier {
  final AuthServiceType authServiceType;
  AboutUsViewModel({required this.authServiceType});
  String aboutUsText =
      '''عازم کجا هستید؟ هیچ فرقی نمی‌کند. این حق شماست که سفری باکیفیت، آسان و مطمئن را تجربه کنید. ایباس، به عنوان رتبه یک فروش بلیط سفر در کنار شماست تا تجربه‌ای شایسته از یک سفر به‌یادماندنی را ایجاد کند. سفر باید آسان باشد، مطمئن و به‌صرفه؛ و همه اینها در ایباس خلاصه شده. از هر کجا به هر کجا، با هواپیما، قطار، اتوبوس یا تور. حتی برای اقامت شایسته در سفرهای خارجی می‌توانید روی هتل‌های ایباس حساب کنید. ایباس همسفر حرفه‌ای‌هاست، و این تجربه‌ی حرفه‌ای در همه مراحل سفر همراه شماست. از زمانی که قصد سفرکرده‌اید و نیاز به راهنمایی دارید ، تا خرید بلیط و پشتیبانی 24 ساعته توسط تیم 247 نفره مرکز پشتیبانی. حتی وقتی که برنامه سفرتان تغییر کرده و قصد استرداد بلیط را دارید ما در کنار شما هستیم. ایباس برندی از هلدینگ پرافتخار توشا (توسعه تجربه شایسته سفر) است، سامانه‌ای که به‌واسطه پشتیبانی و حمایت شما در سکوی اول گردشگری کشور ایستاده. ما به این جایگاه قانع نشده‌ایم و تلاش‌مان برای بهبود لحظه‌ای متوقف نمی‌شود. البته در این مسیر پرپیچ‌و‌خم تنها نیستیم و همسفران شایسته‌ای چون شما دلگرمی اصلی ماست. آمارها نشان می‌دهد که بیشتر از 97 درصد از مشتریان، ما را به دیگران توصیه کرده‌اند و سفیر پیام ایباس شده‌اند. مطمئن هستیم راه را درست رفته‌ایم، چرا که مورداعتماد شما هستیم.''';
  String arzeshText =
      '''ایباس یک خانواده بزرگ است؛ خانواده‌ای که در آن روابط افراد بر اساس اعتماد و همکاری متقابل تعریف شده. در بین اعضای این خانواده ارزش‌هایی شکل گرفته تا کار کردن به یک فعالیت لذت‌بخش تبدیل شود.''';
  String hormatText =
      '''ما در ایباس برای انجام وظایفمان منتظر کلمه‌ها هستیم، نه دستورالعمل و نامه‌ی رسمی؛ درست مثل یک خانواده''';
  String toseeText =
      '''ما در ایباس به دنبال تسهیل تعالی ایباس هستیم؛ تا جایی که زمینه‌ی تعالی واحدهای سازمانی و خود را فراهم کنیم.''';
  String ideText =
      '''ما در ایباس کارهایی را که می‌توانیم با هم انجام دهیم، فردی پیش نمی‌بریم و از با هم بودن لذت می‌بریم.''';
  String pasokhText =
      '''ما در ایباس مطمئن میشویم کوچک‌ترین خواسته‌ها بی‌جواب نمانده است.''';
}
